ARMmbed/DAPLink/source/hic_hal/stm32/stm32wbxx/DAP_config.h
//	  }
//    else
//    {
//        GPIOx->CRL &= ~(0x0000000F << ((pin_bit) << 2));
//        GPIOx->CRL |= ( ((uint32_t)(0x00|0x03) & 0x0F) << ((pin_bit) << 2) );
//    }
//			   GPIOx->MODER == 0x00000002<<((pin_bit)&2);
//			   GPIOx->OTYPER == 0x00000001<<(pin_bit);
//			   GPIOx->OSPEEDR == 0x00000003<<((pin_bit)&2);
	
//			/* Configure the IO Speed */
//        temp = GPIOx->OSPEEDR;
//        temp &= ~(GPIO_OSPEEDER_OSPEEDR0 << (position * 2u));
//        temp |= (GPIO_Init->Speed << (position * 2u));
//        GPIOx->OSPEEDR = temp;

//        /* Configure the IO Output Type */
//        temp = GPIOx->OTYPER;
//        temp &= ~(GPIO_OTYPER_OT_0 << position);
//        temp |= (((GPIO_Init->Mode & GPIO_OUTPUT_TYPE) >> 4u) << position);
//        GPIOx->OTYPER = temp;

//      /* Activate the Pull-up or Pull down resistor for the current IO */
//      temp = GPIOx->PUPDR;
//      temp &= ~(GPIO_PUPDR_PUPDR0 << (position * 2u));
//      temp |= ((GPIO_Init->Pull) << (position * 2u));
//      GPIOx->PUPDR = temp; 
//			
//			/* Configure IO Direction mode (Input, Output, Alternate or Analog) */
//      temp = GPIOx->MODER;
//      temp &= ~(GPIO_MODER_MODER0 << (position * 2u));
//      temp |= ((GPIO_Init->Mode & GPIO_MODE) << (position * 2u));
//      GPIOx->MODER = temp;
//}

//__STATIC_INLINE void pin_out_od_init(GPIO_TypeDef* GPIOx, uint8_t pin_bit)
//{
////    if(pin_bit >= 8)
////    {
////        GPIOx->CRH &= ~(0x0000000F << ((pin_bit-8) << 2));
////        GPIOx->CRH |= ( ((uint32_t)(0x04|0x03) & 0x0F) << ((pin_bit-8) << 2) );
////    }
////    else
////    {
////        GPIOx->CRL &= ~(0x0000000F << ((pin_bit) << 2));
////        GPIOx->CRL |= ( ((uint32_t)(0x04|0x03) & 0x0F) << ((pin_bit) << 2) );
////    }
//	       GPIOx->MODER == 0x00000002<<((pin_bit)&2);
//			   GPIOx->OTYPER == 0x00000001<<(pin_bit);
//			   GPIOx->OSPEEDR == 0x00000003<<((pin_bit)&2);
//}

//__STATIC_INLINE void pin_in_init(GPIO_TypeDef* GPIOx, uint8_t pin_bit, uint8_t mode)
//{
//    uint8_t config;
//    if(mode == 1)
//        config = 0x08; //Up
//    else if(mode == 2)
//        config = 0x08; //down
//    else
//        config = 0x00; //GPIO_Mode_AIN

////    if(pin_bit >= 8)
////    {
////        GPIOx->CRH &= ~(0x0000000F << ((pin_bit-8) << 2));
////        GPIOx->CRH |= ( ((uint32_t)(config) & 0x0F) << ((pin_bit-8) << 2) );
//		     GPIOx->MODER == 0x00000002<<((pin_bit)&2);
//			   GPIOx->OTYPER == 0x00000001<<(pin_bit);
//			   GPIOx->OSPEEDR == 0x00000003<<((pin_bit)&2);
//        if(mode == 1)
//            GPIOx->BSRR = (((uint32_t)0x01) << pin_bit);
//        else if(mode == 2)
//            GPIOx->BRR = (((uint32_t)0x01) << pin_bit);
////    }
////    else
////    {
////        GPIOx->CRL &= ~(0x0000000F << ((pin_bit) << 2));
////        GPIOx->CRL |= ( ((uint32_t)(config) & 0x0F) << ((pin_bit) << 2) );
////        if(mode == 1)
////            GPIOx->BSRR = (((uint32_t)0x01) << pin_bit);
////        else if(mode == 2)
////            GPIOx->BRR = (((uint32_t)0x01) << pin_bit);
////    }
//}

//end biby

//**************************************************************************************************
/**
\defgroup DAP_Config_PortIO_gr CMSIS-DAP Hardware I/O Pin Access
\ingroup DAP_ConfigIO_gr
@{

Standard I/O Pins of the CMSIS-DAP Hardware Debug Port support standard JTAG mode
and Serial Wire Debug (SWD) mode. In SWD mode only 2 pins are required to implement the debug
interface of a device. The following I/O Pins are provided:

JTAG I/O Pin                 | SWD I/O Pin          | CMSIS-DAP Hardware pin mode
---------------------------- | -------------------- | ---------------------------------------------
TCK: Test Clock              | SWCLK: Clock         | Output Push/Pull
TMS: Test Mode Select        | SWDIO: Data I/O      | Output Push/Pull; Input (for receiving data)
TDI: Test Data Input         |                      | Output Push/Pull
TDO: Test Data Output        |                      | Input
nTRST: Test Reset (optional) |                      | Output Open Drain with pull-up resistor
nRESET: Device Reset         | nRESET: Device Reset | Output Open Drain with pull-up resistor


DAP Hardware I/O Pin Access Functions
-------------------------------------
The various I/O Pins are accessed by functions that implement the Read, Write, Set, or Clear to
these I/O Pins.

For the SWDIO I/O Pin there are additional functions that are called in SWD I/O mode only.
This functions are provided to achieve faster I/O that is possible with some advanced GPIO
peripherals that can independently write/read a single I/O pin without affecting any other pins
of the same I/O port. The following SWDIO I/O Pin functions are provided:
 - \ref PIN_SWDIO_OUT_ENABLE to enable the output mode from the DAP hardware.
 - \ref PIN_SWDIO_OUT_DISABLE to enable the input mode to the DAP hardware.
 - \ref PIN_SWDIO_IN to read from the SWDIO I/O pin with utmost possible speed.
 - \ref PIN_SWDIO_OUT to write to the SWDIO I/O pin with utmost possible speed.
*/


// Configure DAP I/O pins ------------------------------

/** Setup JTAG I/O pins: TCK, TMS, TDI, TDO, nTRST, and nRESET.
Configures the DAP Hardware I/O pins for JTAG mode:
 - TCK, TMS, TDI, nTRST, nRESET to output mode and set to high level.
 - TDO to input mode.
*/
__STATIC_INLINE void PORT_JTAG_SETUP(void)
{
#if (DAP_JTAG != 0)

#endif
}

/** Setup SWD I/O pins: SWCLK, SWDIO, and nRESET.
Configures the DAP Hardware I/O pins for Serial Wire Debug (SWD) mode:
 - SWCLK, SWDIO, nRESET to output mode and set to default high level.
 - TDI, TMS, nTRST to HighZ mode (pins are unused in SWD mode).
*/

__STATIC_INLINE void PORT_SWD_SETUP(void)
{
//    // Set SWCLK HIGH
//    pin_out_init(SWCLK_TCK_PIN_PORT, SWCLK_TCK_PIN_Bit);
//    SWCLK_TCK_PIN_PORT->BSRR = SWCLK_TCK_PIN;
//    // Set SWDIO HIGH
//    pin_out_init(SWDIO_OUT_PIN_PORT, SWDIO_OUT_PIN_Bit);
//    SWDIO_OUT_PIN_PORT->BSRR = SWDIO_OUT_PIN;

//    pin_in_init(SWDIO_IN_PIN_PORT, SWDIO_IN_PIN_Bit, 1);
//    // Set RESET HIGH
//    pin_out_od_init(nRESET_PIN_PORT, nRESET_PIN_Bit);//TODO - fix reset logic
//    nRESET_PIN_PORT->BSRR = nRESET_PIN;
	
	 //biby
	 GPIO_InitTypeDef GPIO_InitStruct;
	 // Set SWCLK HIGH
	  
	  GPIO_InitStruct.Pin = SWCLK_TCK_PIN;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    HAL_GPIO_Init(SWCLK_TCK_PIN_PORT, &GPIO_InitStruct);
    SWCLK_TCK_PIN_PORT->BSRR = SWCLK_TCK_PIN;
    // Set SWDIO HIGH
		GPIO_InitStruct.Pin = SWDIO_OUT_PIN;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    HAL_GPIO_Init(SWDIO_OUT_PIN_PORT, &GPIO_InitStruct);
    SWDIO_OUT_PIN_PORT->BSRR = SWDIO_OUT_PIN;
		
		GPIO_InitStruct.Pin = SWDIO_IN_PIN;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    HAL_GPIO_Init(SWDIO_IN_PIN_PORT, &GPIO_InitStruct);
    SWDIO_IN_PIN_PORT->BSRR = (((uint32_t)0x01) << SWDIO_IN_PIN_Bit); 
    //HAL_GPIO_Init(SWDIO_IN_PIN_PORT, SWDIO_IN_PIN_Bit); 
    
    // Set RESET HIGH
		GPIO_InitStruct.Pin = nRESET_PIN;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    HAL_GPIO_Init(nRESET_PIN_PORT, &GPIO_InitStruct);
    //HAL_GPIO_Init(nRESET_PIN_PORT, nRESET_PIN_Bit);//TODO - fix reset logic
    nRESET_PIN_PORT->BSRR = nRESET_PIN;
}

